src/InformationRegisters/МеткиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МеткиКлиентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МеткиКлиентов/Forms/ФормаОповещенияОМетках/Ext/Form/Module.bsl
#Область ОписаниеПеременных
 
 &НаКлиенте
 Перем КодТекущейМетки;
 
 #КонецОбласти
 
 #Область ОбработчикиСобытийФормы

&НаСервере
// При создании формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Клиент",Клиент);
	Параметры.Свойство("Период",Период);
	Период = ?(ЗначениеЗаполнено(Период),Период,ТекущаяДата());
	
	Элементы.ДекорацияКлиент.Заголовок = Строка(Клиент);
	Отказ = НЕ ЗаполнитьТаблицуМетокСоздатьВизуальныеЭлементы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Заполнить список доступных для назначения меток
Функция ЗаполнитьТаблицуМетокСоздатьВизуальныеЭлементы()
	
    // Список назначенных меток
	ПрисвоенныеМетки = РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(Клиент,Период);
	
	Рез = ложь;
	Для Каждого Метка ИЗ ПрисвоенныеМетки Цикл 
		
		Если Метка.Метка.ИнформироватьОСтатусе Тогда
			
			СоздатьВизуальныйЭлементМетки(Метка.Метка,Метка.Комментарий);
			Рез = Истина;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

&НаСервере
// Функция создает группу визуальных элементов привязанных к меткке
// , возвращает признак присвоенности метки клиенту
Процедура СоздатьВизуальныйЭлементМетки(Метка,Комментарий)
		
	// Размещение основной группы
	ОсновнаяГруппа                      = Элементы.Вставить("ГруппаО_" + Строка(Метка.Код),Тип("ГруппаФормы"),Элементы.ГруппаДинамическиеЭлементы);
	ОсновнаяГруппа.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ОсновнаяГруппа.Отображение          = ОтображениеОбычнойГруппы.Нет;
	ОсновнаяГруппа.ОтображатьЗаголовок  = Ложь;
	ОсновнаяГруппа.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	// Размещение кнопки цвета
	НовыйЭл            = Элементы.Добавить("КнопкаЦ_" + Строка(Метка.Код),Тип("КнопкаФормы"),ОсновнаяГруппа);
	НовыйЭл.ИмяКоманды = "Метка";
	НовыйЭл.Заголовок  = " ";
	НовыйЭл.ЦветФона   = ?(ЗначениеЗаполнено(Метка.ЦветМетки),ЗначениеИзСтрокиВнутр(Метка.ЦветМетки),ЦветаСтиля.ЦветФонаФормы);
		
	// Размещение основной группы
	ГруппаПереключателя                      = Элементы.Добавить("ГруппаП_" + Строка(Метка.Код),Тип("ГруппаФормы"),ОсновнаяГруппа);
	ГруппаПереключателя.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПереключателя.Отображение          = ОтображениеОбычнойГруппы.Нет;
	ГруппаПереключателя.ОтображатьЗаголовок  = Ложь;
	ГруппаПереключателя.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// Размещение декорации наименования метки
	НовыйДек                          = Элементы.Добавить("ДекорацияТ_"+Строка(Метка.Код),Тип("ДекорацияФормы"),ГруппаПереключателя);
	НовыйДек.Вид                      = ВидДекорацииФормы.Надпись;
	НовыйДек.Гиперссылка              = Ложь;
	НовыйДек.ЦветТекста               = WebЦвета.Черный;
	НовыйДек.Шрифт                    = Новый Шрифт(НовыйДек.Шрифт,,,Истина);
	НовыйДек.РастягиватьПоГоризонтали = Истина;
	НовыйДек.Заголовок                = Строка(Метка) + ?(Метка.БлокироватьОбслуживание," (Обслуживание заблокировано)","");
	
	// Размещение декарации комментария
	Если Метка.КомментироватьПриУстановке Тогда
		
		ДекКомментарий             = Элементы.Добавить("ДекорацияК_"+Строка(Метка.Код),Тип("ДекорацияФормы"),ГруппаПереключателя);
		ДекКомментарий.Вид         = ВидДекорацииФормы.Надпись;
		ДекКомментарий.Гиперссылка = Ложь;
		ДекКомментарий.РастягиватьПоГоризонтали = Истина;
		ДекКомментарий.Заголовок   = Комментарий;
		ДекКомментарий.Видимость   = Истина; 
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
